{
  "architectures": [
    "PBATransformersForConditionalGeneration"
  ],
  "d_ff": 512,
  "d_kv": 64,
  "d_model": 256,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "switch_transformers",
  "num_heads": 6,
  "num_layers": 4,
  "num_decoder_layers": 4,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to German: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to French: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to Romanian: "
    }
  },
  "use_cache": true,
  "vocab_size": 32128,
  "behavior_injection": true,
  "behavior_embedding_dim": 64,
  "num_sparse_encoder_layers": 4,
  "num_sparse_decoder_layers": 4,
  "sparse_layers_encoder": [],
  "sparse_layers_decoder": [0, 1, 2, 3],
  "behavior_injection_encoder": [0, 1],
  "behavior_injection_decoder": [0, 1],
  "activation_function": "relu",
  "feed_forward_proj": "relu",
  "num_session": 20,
  "use_session_token": true,
  "session_embedding_dim": 64,
  "session_injection_encoder": [],
  "session_injection_decoder": [],
  "freqnum": 64,
  "time_embedding_encoder": [],
  "time_embedding_decoder": [],
  "session_embedding_encoder": [0],
  "session_embedding_decoder": [0]
}