{
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "mlp_type": "Qwen3",
  "Moe_behavior_only": false,
  "moe_intermediate_size": 256,
  "behavior_injection": true,
  "behavior_embedding_dim": 64,
  "sparse_layers_decoder": [0, 1, 2, 3, 4, 5, 6, 7],
  "behavior_injection_decoder": [0, 1, 2, 3],
  "dropout_rate": 0.1,
  "attention_bias": false,
  "attention_dropout": 0.1,
  "bos_token_id": 4,
  "pad_token_id": 4,
  "eos_token_id": 8,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "max_position_embeddings": 40960,
  "max_window_layers": 8,
  "model_type": "qwen3",
  "num_attention_heads": 6,
  "num_hidden_layers": 8,
  "num_key_value_heads": 3,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 14
}